tools/benchmark/results-fetched-50k-1.5kb/results/pg-sheet-get.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /work/k6/sheet-get.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 5m30s max duration (incl. graceful stop):
              * sheet_get: 50 looping VUs for 5m0s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 543 complete and 0 interrupted iterations
sheet_get   [   0% ] 50 VUs  0m01.0s/5m0s

running (0m02.0s), 50/50 VUs, 1295 complete and 0 interrupted iterations
sheet_get   [   1% ] 50 VUs  0m02.0s/5m0s

running (0m03.0s), 50/50 VUs, 2044 complete and 0 interrupted iterations
sheet_get   [   1% ] 50 VUs  0m03.0s/5m0s

running (0m04.0s), 50/50 VUs, 2910 complete and 0 interrupted iterations
sheet_get   [   1% ] 50 VUs  0m04.0s/5m0s

running (0m05.0s), 50/50 VUs, 3740 complete and 0 interrupted iterations
sheet_get   [   2% ] 50 VUs  0m05.0s/5m0s

running (0m06.0s), 50/50 VUs, 4632 complete and 0 interrupted iterations
sheet_get   [   2% ] 50 VUs  0m06.0s/5m0s

running (0m07.0s), 50/50 VUs, 5522 complete and 0 interrupted iterations
sheet_get   [   2% ] 50 VUs  0m07.0s/5m0s

running (0m08.0s), 50/50 VUs, 6414 complete and 0 interrupted iterations
sheet_get   [   3% ] 50 VUs  0m08.0s/5m0s

running (0m09.0s), 50/50 VUs, 7208 complete and 0 interrupted iterations
sheet_get   [   3% ] 50 VUs  0m09.0s/5m0s

running (0m10.0s), 50/50 VUs, 8115 complete and 0 interrupted iterations
sheet_get   [   3% ] 50 VUs  0m10.0s/5m0s

running (0m11.0s), 50/50 VUs, 9049 complete and 0 interrupted iterations
sheet_get   [   4% ] 50 VUs  0m11.0s/5m0s

running (0m12.0s), 50/50 VUs, 9900 complete and 0 interrupted iterations
sheet_get   [   4% ] 50 VUs  0m12.0s/5m0s

running (0m13.0s), 50/50 VUs, 10796 complete and 0 interrupted iterations
sheet_get   [   4% ] 50 VUs  0m13.0s/5m0s

running (0m14.0s), 50/50 VUs, 11705 complete and 0 interrupted iterations
sheet_get   [   5% ] 50 VUs  0m14.0s/5m0s

running (0m15.0s), 50/50 VUs, 12564 complete and 0 interrupted iterations
sheet_get   [   5% ] 50 VUs  0m15.0s/5m0s

running (0m16.0s), 50/50 VUs, 13476 complete and 0 interrupted iterations
sheet_get   [   5% ] 50 VUs  0m16.0s/5m0s

running (0m17.0s), 50/50 VUs, 14410 complete and 0 interrupted iterations
sheet_get   [   6% ] 50 VUs  0m17.0s/5m0s

running (0m18.0s), 50/50 VUs, 15301 complete and 0 interrupted iterations
sheet_get   [   6% ] 50 VUs  0m18.0s/5m0s

running (0m19.0s), 50/50 VUs, 16225 complete and 0 interrupted iterations
sheet_get   [   6% ] 50 VUs  0m19.0s/5m0s

running (0m20.0s), 50/50 VUs, 17149 complete and 0 interrupted iterations
sheet_get   [   7% ] 50 VUs  0m20.0s/5m0s

running (0m21.0s), 50/50 VUs, 18006 complete and 0 interrupted iterations
sheet_get   [   7% ] 50 VUs  0m21.0s/5m0s

running (0m22.0s), 50/50 VUs, 18916 complete and 0 interrupted iterations
sheet_get   [   7% ] 50 VUs  0m22.0s/5m0s

running (0m23.0s), 50/50 VUs, 19826 complete and 0 interrupted iterations
sheet_get   [   8% ] 50 VUs  0m23.0s/5m0s

running (0m24.0s), 50/50 VUs, 20739 complete and 0 interrupted iterations
sheet_get   [   8% ] 50 VUs  0m24.0s/5m0s

running (0m25.0s), 50/50 VUs, 21608 complete and 0 interrupted iterations
sheet_get   [   8% ] 50 VUs  0m25.0s/5m0s

running (0m26.0s), 50/50 VUs, 22497 complete and 0 interrupted iterations
sheet_get   [   9% ] 50 VUs  0m26.0s/5m0s

running (0m27.0s), 50/50 VUs, 23295 complete and 0 interrupted iterations
sheet_get   [   9% ] 50 VUs  0m27.0s/5m0s

running (0m28.0s), 50/50 VUs, 24203 complete and 0 interrupted iterations
sheet_get   [   9% ] 50 VUs  0m28.0s/5m0s

running (0m29.0s), 50/50 VUs, 25151 complete and 0 interrupted iterations
sheet_get   [  10% ] 50 VUs  0m29.0s/5m0s

running (0m30.0s), 50/50 VUs, 26086 complete and 0 interrupted iterations
sheet_get   [  10% ] 50 VUs  0m30.0s/5m0s

running (0m31.0s), 50/50 VUs, 27005 complete and 0 interrupted iterations
sheet_get   [  10% ] 50 VUs  0m31.0s/5m0s

running (0m32.0s), 50/50 VUs, 27838 complete and 0 interrupted iterations
sheet_get   [  11% ] 50 VUs  0m32.0s/5m0s

running (0m33.0s), 50/50 VUs, 28656 complete and 0 interrupted iterations
sheet_get   [  11% ] 50 VUs  0m33.0s/5m0s

running (0m34.0s), 50/50 VUs, 29593 complete and 0 interrupted iterations
sheet_get   [  11% ] 50 VUs  0m34.0s/5m0s

running (0m35.0s), 50/50 VUs, 30531 complete and 0 interrupted iterations
sheet_get   [  12% ] 50 VUs  0m35.0s/5m0s

running (0m36.0s), 50/50 VUs, 31461 complete and 0 interrupted iterations
sheet_get   [  12% ] 50 VUs  0m36.0s/5m0s

running (0m37.0s), 50/50 VUs, 32350 complete and 0 interrupted iterations
sheet_get   [  12% ] 50 VUs  0m37.0s/5m0s

running (0m38.0s), 50/50 VUs, 33278 complete and 0 interrupted iterations
sheet_get   [  13% ] 50 VUs  0m38.0s/5m0s

running (0m39.0s), 50/50 VUs, 34168 complete and 0 interrupted iterations
sheet_get   [  13% ] 50 VUs  0m39.0s/5m0s

running (0m40.0s), 50/50 VUs, 35094 complete and 0 interrupted iterations
sheet_get   [  13% ] 50 VUs  0m40.0s/5m0s

running (0m41.0s), 50/50 VUs, 36020 complete and 0 interrupted iterations
sheet_get   [  14% ] 50 VUs  0m41.0s/5m0s

running (0m42.0s), 50/50 VUs, 36909 complete and 0 interrupted iterations
sheet_get   [  14% ] 50 VUs  0m42.0s/5m0s

running (0m43.0s), 50/50 VUs, 37812 complete and 0 interrupted iterations
sheet_get   [  14% ] 50 VUs  0m43.0s/5m0s

running (0m44.0s), 50/50 VUs, 38738 complete and 0 interrupted iterations
sheet_get   [  15% ] 50 VUs  0m44.0s/5m0s

running (0m45.0s), 50/50 VUs, 39586 complete and 0 interrupted iterations
sheet_get   [  15% ] 50 VUs  0m45.0s/5m0s

running (0m46.0s), 50/50 VUs, 40400 complete and 0 interrupted iterations
sheet_get   [  15% ] 50 VUs  0m46.0s/5m0s

running (0m47.0s), 50/50 VUs, 41313 complete and 0 interrupted iterations
sheet_get   [  16% ] 50 VUs  0m47.0s/5m0s

running (0m48.0s), 50/50 VUs, 42235 complete and 0 interrupted iterations
sheet_get   [  16% ] 50 VUs  0m48.0s/5m0s

running (0m49.0s), 50/50 VUs, 43167 complete and 0 interrupted iterations
sheet_get   [  16% ] 50 VUs  0m49.0s/5m0s

running (0m50.0s), 50/50 VUs, 44094 complete and 0 interrupted iterations
sheet_get   [  17% ] 50 VUs  0m50.0s/5m0s

running (0m51.0s), 50/50 VUs, 44855 complete and 0 interrupted iterations
sheet_get   [  17% ] 50 VUs  0m51.0s/5m0s

running (0m52.0s), 50/50 VUs, 45716 complete and 0 interrupted iterations
sheet_get   [  17% ] 50 VUs  0m52.0s/5m0s

running (0m53.0s), 50/50 VUs, 46639 complete and 0 interrupted iterations
sheet_get   [  18% ] 50 VUs  0m53.0s/5m0s

running (0m54.0s), 50/50 VUs, 47578 complete and 0 interrupted iterations
sheet_get   [  18% ] 50 VUs  0m54.0s/5m0s

running (0m55.0s), 50/50 VUs, 48519 complete and 0 interrupted iterations
sheet_get   [  18% ] 50 VUs  0m55.0s/5m0s

running (0m56.0s), 50/50 VUs, 49466 complete and 0 interrupted iterations
sheet_get   [  19% ] 50 VUs  0m56.0s/5m0s

running (0m57.0s), 50/50 VUs, 50284 complete and 0 interrupted iterations
sheet_get   [  19% ] 50 VUs  0m57.0s/5m0s

running (0m58.0s), 50/50 VUs, 51188 complete and 0 interrupted iterations
sheet_get   [  19% ] 50 VUs  0m58.0s/5m0s

running (0m59.0s), 50/50 VUs, 52122 complete and 0 interrupted iterations
sheet_get   [  20% ] 50 VUs  0m59.0s/5m0s

running (1m00.0s), 50/50 VUs, 53070 complete and 0 interrupted iterations
sheet_get   [  20% ] 50 VUs  1m00.0s/5m0s

running (1m01.0s), 50/50 VUs, 53972 complete and 0 interrupted iterations
sheet_get   [  20% ] 50 VUs  1m01.0s/5m0s

running (1m02.0s), 50/50 VUs, 54907 complete and 0 interrupted iterations
sheet_get   [  21% ] 50 VUs  1m02.0s/5m0s

running (1m03.0s), 50/50 VUs, 55700 complete and 0 interrupted iterations
sheet_get   [  21% ] 50 VUs  1m03.0s/5m0s

running (1m04.0s), 50/50 VUs, 56638 complete and 0 interrupted iterations
sheet_get   [  21% ] 50 VUs  1m04.0s/5m0s

running (1m05.0s), 50/50 VUs, 57530 complete and 0 interrupted iterations
sheet_get   [  22% ] 50 VUs  1m05.0s/5m0s

running (1m06.0s), 50/50 VUs, 58473 complete and 0 interrupted iterations
sheet_get   [  22% ] 50 VUs  1m06.0s/5m0s

running (1m07.0s), 50/50 VUs, 59387 complete and 0 interrupted iterations
sheet_get   [  22% ] 50 VUs  1m07.0s/5m0s

running (1m08.0s), 50/50 VUs, 60301 complete and 0 interrupted iterations
sheet_get   [  23% ] 50 VUs  1m08.0s/5m0s

running (1m09.0s), 50/50 VUs, 61183 complete and 0 interrupted iterations
sheet_get   [  23% ] 50 VUs  1m09.0s/5m0s

running (1m10.0s), 50/50 VUs, 62132 complete and 0 interrupted iterations
sheet_get   [  23% ] 50 VUs  1m10.0s/5m0s

running (1m11.0s), 50/50 VUs, 63073 complete and 0 interrupted iterations
sheet_get   [  24% ] 50 VUs  1m11.0s/5m0s

running (1m12.0s), 50/50 VUs, 63943 complete and 0 interrupted iterations
sheet_get   [  24% ] 50 VUs  1m12.0s/5m0s

running (1m13.0s), 50/50 VUs, 64814 complete and 0 interrupted iterations
sheet_get   [  24% ] 50 VUs  1m13.0s/5m0s

running (1m14.0s), 50/50 VUs, 65746 complete and 0 interrupted iterations
sheet_get   [  25% ] 50 VUs  1m14.0s/5m0s

running (1m15.0s), 50/50 VUs, 66609 complete and 0 interrupted iterations
sheet_get   [  25% ] 50 VUs  1m15.0s/5m0s

running (1m16.0s), 50/50 VUs, 67527 complete and 0 interrupted iterations
sheet_get   [  25% ] 50 VUs  1m16.0s/5m0s

running (1m17.0s), 50/50 VUs, 68466 complete and 0 interrupted iterations
sheet_get   [  26% ] 50 VUs  1m17.0s/5m0s

running (1m18.0s), 50/50 VUs, 69377 complete and 0 interrupted iterations
sheet_get   [  26% ] 50 VUs  1m18.0s/5m0s

running (1m19.0s), 50/50 VUs, 70299 complete and 0 interrupted iterations
sheet_get   [  26% ] 50 VUs  1m19.0s/5m0s

running (1m20.0s), 50/50 VUs, 71237 complete and 0 interrupted iterations
sheet_get   [  27% ] 50 VUs  1m20.0s/5m0s

running (1m21.0s), 50/50 VUs, 72132 complete and 0 interrupted iterations
sheet_get   [  27% ] 50 VUs  1m21.0s/5m0s

running (1m22.0s), 50/50 VUs, 73039 complete and 0 interrupted iterations
sheet_get   [  27% ] 50 VUs  1m22.0s/5m0s

running (1m23.0s), 50/50 VUs, 73966 complete and 0 interrupted iterations
sheet_get   [  28% ] 50 VUs  1m23.0s/5m0s

running (1m24.0s), 50/50 VUs, 74909 complete and 0 interrupted iterations
sheet_get   [  28% ] 50 VUs  1m24.0s/5m0s

running (1m25.0s), 50/50 VUs, 75840 complete and 0 interrupted iterations
sheet_get   [  28% ] 50 VUs  1m25.0s/5m0s

running (1m26.0s), 50/50 VUs, 76765 complete and 0 interrupted iterations
sheet_get   [  29% ] 50 VUs  1m26.0s/5m0s

running (1m27.0s), 50/50 VUs, 77638 complete and 0 interrupted iterations
sheet_get   [  29% ] 50 VUs  1m27.0s/5m0s

running (1m28.0s), 50/50 VUs, 78562 complete and 0 interrupted iterations
sheet_get   [  29% ] 50 VUs  1m28.0s/5m0s

running (1m29.0s), 50/50 VUs, 79480 complete and 0 interrupted iterations
sheet_get   [  30% ] 50 VUs  1m29.0s/5m0s

running (1m30.0s), 50/50 VUs, 80415 complete and 0 interrupted iterations
sheet_get   [  30% ] 50 VUs  1m30.0s/5m0s

running (1m31.0s), 50/50 VUs, 81343 complete and 0 interrupted iterations
sheet_get   [  30% ] 50 VUs  1m31.0s/5m0s

running (1m32.0s), 50/50 VUs, 82275 complete and 0 interrupted iterations
sheet_get   [  31% ] 50 VUs  1m32.0s/5m0s

running (1m33.0s), 50/50 VUs, 83092 complete and 0 interrupted iterations
sheet_get   [  31% ] 50 VUs  1m33.0s/5m0s

running (1m34.0s), 50/50 VUs, 84042 complete and 0 interrupted iterations
sheet_get   [  31% ] 50 VUs  1m34.0s/5m0s

running (1m35.0s), 50/50 VUs, 84963 complete and 0 interrupted iterations
sheet_get   [  32% ] 50 VUs  1m35.0s/5m0s

running (1m36.0s), 50/50 VUs, 85920 complete and 0 interrupted iterations
sheet_get   [  32% ] 50 VUs  1m36.0s/5m0s

running (1m37.0s), 50/50 VUs, 86800 complete and 0 interrupted iterations
sheet_get   [  32% ] 50 VUs  1m37.0s/5m0s

running (1m38.0s), 50/50 VUs, 87686 complete and 0 interrupted iterations
sheet_get   [  33% ] 50 VUs  1m38.0s/5m0s

running (1m39.0s), 50/50 VUs, 88510 complete and 0 interrupted iterations
sheet_get   [  33% ] 50 VUs  1m39.0s/5m0s

running (1m40.0s), 50/50 VUs, 89458 complete and 0 interrupted iterations
sheet_get   [  33% ] 50 VUs  1m40.0s/5m0s

running (1m41.0s), 50/50 VUs, 90335 complete and 0 interrupted iterations
sheet_get   [  34% ] 50 VUs  1m41.0s/5m0s

running (1m42.0s), 50/50 VUs, 91262 complete and 0 interrupted iterations
sheet_get   [  34% ] 50 VUs  1m42.0s/5m0s

running (1m43.0s), 50/50 VUs, 92183 complete and 0 interrupted iterations
sheet_get   [  34% ] 50 VUs  1m43.0s/5m0s

running (1m44.0s), 50/50 VUs, 93093 complete and 0 interrupted iterations
sheet_get   [  35% ] 50 VUs  1m44.0s/5m0s

running (1m45.0s), 50/50 VUs, 93956 complete and 0 interrupted iterations
sheet_get   [  35% ] 50 VUs  1m45.0s/5m0s

running (1m46.0s), 50/50 VUs, 94803 complete and 0 interrupted iterations
sheet_get   [  35% ] 50 VUs  1m46.0s/5m0s

running (1m47.0s), 50/50 VUs, 95717 complete and 0 interrupted iterations
sheet_get   [  36% ] 50 VUs  1m47.0s/5m0s

running (1m48.0s), 50/50 VUs, 96623 complete and 0 interrupted iterations
sheet_get   [  36% ] 50 VUs  1m48.0s/5m0s

running (1m49.0s), 50/50 VUs, 97540 complete and 0 interrupted iterations
sheet_get   [  36% ] 50 VUs  1m49.0s/5m0s

running (1m50.0s), 50/50 VUs, 98404 complete and 0 interrupted iterations
sheet_get   [  37% ] 50 VUs  1m50.0s/5m0s

running (1m51.0s), 50/50 VUs, 99256 complete and 0 interrupted iterations
sheet_get   [  37% ] 50 VUs  1m51.0s/5m0s

running (1m52.0s), 50/50 VUs, 100169 complete and 0 interrupted iterations
sheet_get   [  37% ] 50 VUs  1m52.0s/5m0s

running (1m53.0s), 50/50 VUs, 101091 complete and 0 interrupted iterations
sheet_get   [  38% ] 50 VUs  1m53.0s/5m0s

running (1m54.0s), 50/50 VUs, 102029 complete and 0 interrupted iterations
sheet_get   [  38% ] 50 VUs  1m54.0s/5m0s

running (1m55.0s), 50/50 VUs, 102912 complete and 0 interrupted iterations
sheet_get   [  38% ] 50 VUs  1m55.0s/5m0s

running (1m56.0s), 50/50 VUs, 103847 complete and 0 interrupted iterations
sheet_get   [  39% ] 50 VUs  1m56.0s/5m0s

running (1m57.0s), 50/50 VUs, 104705 complete and 0 interrupted iterations
sheet_get   [  39% ] 50 VUs  1m57.0s/5m0s

running (1m58.0s), 50/50 VUs, 105599 complete and 0 interrupted iterations
sheet_get   [  39% ] 50 VUs  1m58.0s/5m0s

running (1m59.0s), 50/50 VUs, 106515 complete and 0 interrupted iterations
sheet_get   [  40% ] 50 VUs  1m59.0s/5m0s

running (2m00.0s), 50/50 VUs, 107415 complete and 0 interrupted iterations
sheet_get   [  40% ] 50 VUs  2m00.0s/5m0s

running (2m01.0s), 50/50 VUs, 108346 complete and 0 interrupted iterations
sheet_get   [  40% ] 50 VUs  2m01.0s/5m0s

running (2m02.0s), 50/50 VUs, 109276 complete and 0 interrupted iterations
sheet_get   [  41% ] 50 VUs  2m02.0s/5m0s

running (2m03.0s), 50/50 VUs, 110086 complete and 0 interrupted iterations
sheet_get   [  41% ] 50 VUs  2m03.0s/5m0s

running (2m04.0s), 50/50 VUs, 110951 complete and 0 interrupted iterations
sheet_get   [  41% ] 50 VUs  2m04.0s/5m0s

running (2m05.0s), 50/50 VUs, 111878 complete and 0 interrupted iterations
sheet_get   [  42% ] 50 VUs  2m05.0s/5m0s

running (2m06.0s), 50/50 VUs, 112815 complete and 0 interrupted iterations
sheet_get   [  42% ] 50 VUs  2m06.0s/5m0s

running (2m07.0s), 50/50 VUs, 113767 complete and 0 interrupted iterations
sheet_get   [  42% ] 50 VUs  2m07.0s/5m0s

running (2m08.0s), 50/50 VUs, 114676 complete and 0 interrupted iterations
sheet_get   [  43% ] 50 VUs  2m08.0s/5m0s

running (2m09.0s), 50/50 VUs, 115452 complete and 0 interrupted iterations
sheet_get   [  43% ] 50 VUs  2m09.0s/5m0s

running (2m10.0s), 50/50 VUs, 116394 complete and 0 interrupted iterations
sheet_get   [  43% ] 50 VUs  2m10.0s/5m0s

running (2m11.0s), 50/50 VUs, 117332 complete and 0 interrupted iterations
sheet_get   [  44% ] 50 VUs  2m11.0s/5m0s

running (2m12.0s), 50/50 VUs, 118280 complete and 0 interrupted iterations
sheet_get   [  44% ] 50 VUs  2m12.0s/5m0s

running (2m13.0s), 50/50 VUs, 119100 complete and 0 interrupted iterations
sheet_get   [  44% ] 50 VUs  2m13.0s/5m0s

running (2m14.0s), 50/50 VUs, 120006 complete and 0 interrupted iterations
sheet_get   [  45% ] 50 VUs  2m14.0s/5m0s

running (2m15.0s), 50/50 VUs, 120867 complete and 0 interrupted iterations
sheet_get   [  45% ] 50 VUs  2m15.0s/5m0s

running (2m16.0s), 50/50 VUs, 121786 complete and 0 interrupted iterations
sheet_get   [  45% ] 50 VUs  2m16.0s/5m0s

running (2m17.0s), 50/50 VUs, 122660 complete and 0 interrupted iterations
sheet_get   [  46% ] 50 VUs  2m17.0s/5m0s

running (2m18.0s), 50/50 VUs, 123592 complete and 0 interrupted iterations
sheet_get   [  46% ] 50 VUs  2m18.0s/5m0s

running (2m19.0s), 50/50 VUs, 124491 complete and 0 interrupted iterations
sheet_get   [  46% ] 50 VUs  2m19.0s/5m0s

running (2m20.0s), 50/50 VUs, 125429 complete and 0 interrupted iterations
sheet_get   [  47% ] 50 VUs  2m20.0s/5m0s

running (2m21.0s), 50/50 VUs, 126311 complete and 0 interrupted iterations
sheet_get   [  47% ] 50 VUs  2m21.0s/5m0s

running (2m22.0s), 50/50 VUs, 127205 complete and 0 interrupted iterations
sheet_get   [  47% ] 50 VUs  2m22.0s/5m0s

running (2m23.0s), 50/50 VUs, 128128 complete and 0 interrupted iterations
sheet_get   [  48% ] 50 VUs  2m23.0s/5m0s

running (2m24.0s), 50/50 VUs, 129042 complete and 0 interrupted iterations
sheet_get   [  48% ] 50 VUs  2m24.0s/5m0s

running (2m25.0s), 50/50 VUs, 129977 complete and 0 interrupted iterations
sheet_get   [  48% ] 50 VUs  2m25.0s/5m0s

running (2m26.0s), 50/50 VUs, 130888 complete and 0 interrupted iterations
sheet_get   [  49% ] 50 VUs  2m26.0s/5m0s

running (2m27.0s), 50/50 VUs, 131759 complete and 0 interrupted iterations
sheet_get   [  49% ] 50 VUs  2m27.0s/5m0s

running (2m28.0s), 50/50 VUs, 132694 complete and 0 interrupted iterations
sheet_get   [  49% ] 50 VUs  2m28.0s/5m0s

running (2m29.0s), 50/50 VUs, 133621 complete and 0 interrupted iterations
sheet_get   [  50% ] 50 VUs  2m29.0s/5m0s

running (2m30.0s), 50/50 VUs, 134564 complete and 0 interrupted iterations
sheet_get   [  50% ] 50 VUs  2m30.0s/5m0s

running (2m31.0s), 50/50 VUs, 135409 complete and 0 interrupted iterations
sheet_get   [  50% ] 50 VUs  2m31.0s/5m0s

running (2m32.0s), 50/50 VUs, 136356 complete and 0 interrupted iterations
sheet_get   [  51% ] 50 VUs  2m32.0s/5m0s

running (2m33.0s), 50/50 VUs, 137183 complete and 0 interrupted iterations
sheet_get   [  51% ] 50 VUs  2m33.0s/5m0s

running (2m34.0s), 50/50 VUs, 138097 complete and 0 interrupted iterations
sheet_get   [  51% ] 50 VUs  2m34.0s/5m0s

running (2m35.0s), 50/50 VUs, 138986 complete and 0 interrupted iterations
sheet_get   [  52% ] 50 VUs  2m35.0s/5m0s

running (2m36.0s), 50/50 VUs, 139921 complete and 0 interrupted iterations
sheet_get   [  52% ] 50 VUs  2m36.0s/5m0s

running (2m37.0s), 50/50 VUs, 140871 complete and 0 interrupted iterations
sheet_get   [  52% ] 50 VUs  2m37.0s/5m0s

running (2m38.0s), 50/50 VUs, 141809 complete and 0 interrupted iterations
sheet_get   [  53% ] 50 VUs  2m38.0s/5m0s

running (2m39.0s), 50/50 VUs, 142643 complete and 0 interrupted iterations
sheet_get   [  53% ] 50 VUs  2m39.0s/5m0s

running (2m40.0s), 50/50 VUs, 143572 complete and 0 interrupted iterations
sheet_get   [  53% ] 50 VUs  2m40.0s/5m0s

running (2m41.0s), 50/50 VUs, 144503 complete and 0 interrupted iterations
sheet_get   [  54% ] 50 VUs  2m41.0s/5m0s

running (2m42.0s), 50/50 VUs, 145442 complete and 0 interrupted iterations
sheet_get   [  54% ] 50 VUs  2m42.0s/5m0s

running (2m43.0s), 50/50 VUs, 146384 complete and 0 interrupted iterations
sheet_get   [  54% ] 50 VUs  2m43.0s/5m0s

running (2m44.0s), 50/50 VUs, 147329 complete and 0 interrupted iterations
sheet_get   [  55% ] 50 VUs  2m44.0s/5m0s

running (2m45.0s), 50/50 VUs, 148151 complete and 0 interrupted iterations
sheet_get   [  55% ] 50 VUs  2m45.0s/5m0s

running (2m46.0s), 50/50 VUs, 149054 complete and 0 interrupted iterations
sheet_get   [  55% ] 50 VUs  2m46.0s/5m0s

running (2m47.0s), 50/50 VUs, 149913 complete and 0 interrupted iterations
sheet_get   [  56% ] 50 VUs  2m47.0s/5m0s

running (2m48.0s), 50/50 VUs, 150848 complete and 0 interrupted iterations
sheet_get   [  56% ] 50 VUs  2m48.0s/5m0s

running (2m49.0s), 50/50 VUs, 151769 complete and 0 interrupted iterations
sheet_get   [  56% ] 50 VUs  2m49.0s/5m0s

running (2m50.0s), 50/50 VUs, 152676 complete and 0 interrupted iterations
sheet_get   [  57% ] 50 VUs  2m50.0s/5m0s

running (2m51.0s), 50/50 VUs, 153484 complete and 0 interrupted iterations
sheet_get   [  57% ] 50 VUs  2m51.0s/5m0s

running (2m52.0s), 50/50 VUs, 154419 complete and 0 interrupted iterations
sheet_get   [  57% ] 50 VUs  2m52.0s/5m0s

running (2m53.0s), 50/50 VUs, 155344 complete and 0 interrupted iterations
sheet_get   [  58% ] 50 VUs  2m53.0s/5m0s

running (2m54.0s), 50/50 VUs, 156294 complete and 0 interrupted iterations
sheet_get   [  58% ] 50 VUs  2m54.0s/5m0s

running (2m55.0s), 50/50 VUs, 157187 complete and 0 interrupted iterations
sheet_get   [  58% ] 50 VUs  2m55.0s/5m0s

running (2m56.0s), 50/50 VUs, 158095 complete and 0 interrupted iterations
sheet_get   [  59% ] 50 VUs  2m56.0s/5m0s

running (2m57.0s), 50/50 VUs, 158995 complete and 0 interrupted iterations
sheet_get   [  59% ] 50 VUs  2m57.0s/5m0s

running (2m58.0s), 50/50 VUs, 159941 complete and 0 interrupted iterations
sheet_get   [  59% ] 50 VUs  2m58.0s/5m0s

running (2m59.0s), 50/50 VUs, 160869 complete and 0 interrupted iterations
sheet_get   [  60% ] 50 VUs  2m59.0s/5m0s

running (3m00.0s), 50/50 VUs, 161802 complete and 0 interrupted iterations
sheet_get   [  60% ] 50 VUs  3m00.0s/5m0s

running (3m01.0s), 50/50 VUs, 162745 complete and 0 interrupted iterations
sheet_get   [  60% ] 50 VUs  3m01.0s/5m0s

running (3m02.0s), 50/50 VUs, 163665 complete and 0 interrupted iterations
sheet_get   [  61% ] 50 VUs  3m02.0s/5m0s

running (3m03.0s), 50/50 VUs, 164517 complete and 0 interrupted iterations
sheet_get   [  61% ] 50 VUs  3m03.0s/5m0s

running (3m04.0s), 50/50 VUs, 165459 complete and 0 interrupted iterations
sheet_get   [  61% ] 50 VUs  3m04.0s/5m0s

running (3m05.0s), 50/50 VUs, 166358 complete and 0 interrupted iterations
sheet_get   [  62% ] 50 VUs  3m05.0s/5m0s

running (3m06.0s), 50/50 VUs, 167276 complete and 0 interrupted iterations
sheet_get   [  62% ] 50 VUs  3m06.0s/5m0s

running (3m07.0s), 50/50 VUs, 168227 complete and 0 interrupted iterations
sheet_get   [  62% ] 50 VUs  3m07.0s/5m0s

running (3m08.0s), 50/50 VUs, 169148 complete and 0 interrupted iterations
sheet_get   [  63% ] 50 VUs  3m08.0s/5m0s

running (3m09.0s), 50/50 VUs, 169986 complete and 0 interrupted iterations
sheet_get   [  63% ] 50 VUs  3m09.0s/5m0s

running (3m10.0s), 50/50 VUs, 170913 complete and 0 interrupted iterations
sheet_get   [  63% ] 50 VUs  3m10.0s/5m0s

running (3m11.0s), 50/50 VUs, 171844 complete and 0 interrupted iterations
sheet_get   [  64% ] 50 VUs  3m11.0s/5m0s

running (3m12.0s), 50/50 VUs, 172778 complete and 0 interrupted iterations
sheet_get   [  64% ] 50 VUs  3m12.0s/5m0s

running (3m13.0s), 50/50 VUs, 173686 complete and 0 interrupted iterations
sheet_get   [  64% ] 50 VUs  3m13.0s/5m0s

running (3m14.0s), 50/50 VUs, 174548 complete and 0 interrupted iterations
sheet_get   [  65% ] 50 VUs  3m14.0s/5m0s

running (3m15.0s), 50/50 VUs, 175370 complete and 0 interrupted iterations
sheet_get   [  65% ] 50 VUs  3m15.0s/5m0s

running (3m16.0s), 50/50 VUs, 176268 complete and 0 interrupted iterations
sheet_get   [  65% ] 50 VUs  3m16.0s/5m0s

running (3m17.0s), 50/50 VUs, 177142 complete and 0 interrupted iterations
sheet_get   [  66% ] 50 VUs  3m17.0s/5m0s

running (3m18.0s), 50/50 VUs, 178092 complete and 0 interrupted iterations
sheet_get   [  66% ] 50 VUs  3m18.0s/5m0s

running (3m19.0s), 50/50 VUs, 179037 complete and 0 interrupted iterations
sheet_get   [  66% ] 50 VUs  3m19.0s/5m0s

running (3m20.0s), 50/50 VUs, 179922 complete and 0 interrupted iterations
sheet_get   [  67% ] 50 VUs  3m20.0s/5m0s

running (3m21.0s), 50/50 VUs, 180690 complete and 0 interrupted iterations
sheet_get   [  67% ] 50 VUs  3m21.0s/5m0s

running (3m22.0s), 50/50 VUs, 181619 complete and 0 interrupted iterations
sheet_get   [  67% ] 50 VUs  3m22.0s/5m0s

running (3m23.0s), 50/50 VUs, 182538 complete and 0 interrupted iterations
sheet_get   [  68% ] 50 VUs  3m23.0s/5m0s

running (3m24.0s), 50/50 VUs, 183487 complete and 0 interrupted iterations
sheet_get   [  68% ] 50 VUs  3m24.0s/5m0s

running (3m25.0s), 50/50 VUs, 184442 complete and 0 interrupted iterations
sheet_get   [  68% ] 50 VUs  3m25.0s/5m0s

running (3m26.0s), 50/50 VUs, 185266 complete and 0 interrupted iterations
sheet_get   [  69% ] 50 VUs  3m26.0s/5m0s

running (3m27.0s), 50/50 VUs, 186124 complete and 0 interrupted iterations
sheet_get   [  69% ] 50 VUs  3m27.0s/5m0s

running (3m28.0s), 50/50 VUs, 187072 complete and 0 interrupted iterations
sheet_get   [  69% ] 50 VUs  3m28.0s/5m0s

running (3m29.0s), 50/50 VUs, 188009 complete and 0 interrupted iterations
sheet_get   [  70% ] 50 VUs  3m29.0s/5m0s

running (3m30.0s), 50/50 VUs, 188909 complete and 0 interrupted iterations
sheet_get   [  70% ] 50 VUs  3m30.0s/5m0s

running (3m31.0s), 50/50 VUs, 189798 complete and 0 interrupted iterations
sheet_get   [  70% ] 50 VUs  3m31.0s/5m0s

running (3m32.0s), 50/50 VUs, 190731 complete and 0 interrupted iterations
sheet_get   [  71% ] 50 VUs  3m32.0s/5m0s

running (3m33.0s), 50/50 VUs, 191591 complete and 0 interrupted iterations
sheet_get   [  71% ] 50 VUs  3m33.0s/5m0s

running (3m34.0s), 50/50 VUs, 192507 complete and 0 interrupted iterations
sheet_get   [  71% ] 50 VUs  3m34.0s/5m0s

running (3m35.0s), 50/50 VUs, 193435 complete and 0 interrupted iterations
sheet_get   [  72% ] 50 VUs  3m35.0s/5m0s

running (3m36.0s), 50/50 VUs, 194347 complete and 0 interrupted iterations
sheet_get   [  72% ] 50 VUs  3m36.0s/5m0s

running (3m37.0s), 50/50 VUs, 195286 complete and 0 interrupted iterations
sheet_get   [  72% ] 50 VUs  3m37.0s/5m0s

running (3m38.0s), 50/50 VUs, 196220 complete and 0 interrupted iterations
sheet_get   [  73% ] 50 VUs  3m38.0s/5m0s

running (3m39.0s), 50/50 VUs, 197024 complete and 0 interrupted iterations
sheet_get   [  73% ] 50 VUs  3m39.0s/5m0s

running (3m40.0s), 50/50 VUs, 197938 complete and 0 interrupted iterations
sheet_get   [  73% ] 50 VUs  3m40.0s/5m0s

running (3m41.0s), 50/50 VUs, 198860 complete and 0 interrupted iterations
sheet_get   [  74% ] 50 VUs  3m41.0s/5m0s

running (3m42.0s), 50/50 VUs, 199792 complete and 0 interrupted iterations
sheet_get   [  74% ] 50 VUs  3m42.0s/5m0s

running (3m43.0s), 50/50 VUs, 200684 complete and 0 interrupted iterations
sheet_get   [  74% ] 50 VUs  3m43.0s/5m0s

running (3m44.0s), 50/50 VUs, 201614 complete and 0 interrupted iterations
sheet_get   [  75% ] 50 VUs  3m44.0s/5m0s

running (3m45.0s), 50/50 VUs, 202507 complete and 0 interrupted iterations
sheet_get   [  75% ] 50 VUs  3m45.0s/5m0s

running (3m46.0s), 50/50 VUs, 203399 complete and 0 interrupted iterations
sheet_get   [  75% ] 50 VUs  3m46.0s/5m0s

running (3m47.0s), 50/50 VUs, 204276 complete and 0 interrupted iterations
sheet_get   [  76% ] 50 VUs  3m47.0s/5m0s

running (3m48.0s), 50/50 VUs, 205162 complete and 0 interrupted iterations
sheet_get   [  76% ] 50 VUs  3m48.0s/5m0s

running (3m49.0s), 50/50 VUs, 206096 complete and 0 interrupted iterations
sheet_get   [  76% ] 50 VUs  3m49.0s/5m0s

running (3m50.0s), 50/50 VUs, 207011 complete and 0 interrupted iterations
sheet_get   [  77% ] 50 VUs  3m50.0s/5m0s

running (3m51.0s), 50/50 VUs, 207867 complete and 0 interrupted iterations
sheet_get   [  77% ] 50 VUs  3m51.0s/5m0s

running (3m52.0s), 50/50 VUs, 208748 complete and 0 interrupted iterations
sheet_get   [  77% ] 50 VUs  3m52.0s/5m0s

running (3m53.0s), 50/50 VUs, 209675 complete and 0 interrupted iterations
sheet_get   [  78% ] 50 VUs  3m53.0s/5m0s

running (3m54.0s), 50/50 VUs, 210618 complete and 0 interrupted iterations
sheet_get   [  78% ] 50 VUs  3m54.0s/5m0s

running (3m55.0s), 50/50 VUs, 211559 complete and 0 interrupted iterations
sheet_get   [  78% ] 50 VUs  3m55.0s/5m0s

running (3m56.0s), 50/50 VUs, 212497 complete and 0 interrupted iterations
sheet_get   [  79% ] 50 VUs  3m56.0s/5m0s

running (3m57.0s), 50/50 VUs, 213318 complete and 0 interrupted iterations
sheet_get   [  79% ] 50 VUs  3m57.0s/5m0s

running (3m58.0s), 50/50 VUs, 214220 complete and 0 interrupted iterations
sheet_get   [  79% ] 50 VUs  3m58.0s/5m0s

running (3m59.0s), 50/50 VUs, 215149 complete and 0 interrupted iterations
sheet_get   [  80% ] 50 VUs  3m59.0s/5m0s

running (4m00.0s), 50/50 VUs, 216080 complete and 0 interrupted iterations
sheet_get   [  80% ] 50 VUs  4m00.0s/5m0s

running (4m01.0s), 50/50 VUs, 216956 complete and 0 interrupted iterations
sheet_get   [  80% ] 50 VUs  4m01.0s/5m0s

running (4m02.0s), 50/50 VUs, 217870 complete and 0 interrupted iterations
sheet_get   [  81% ] 50 VUs  4m02.0s/5m0s

running (4m03.0s), 50/50 VUs, 218764 complete and 0 interrupted iterations
sheet_get   [  81% ] 50 VUs  4m03.0s/5m0s

running (4m04.0s), 50/50 VUs, 219670 complete and 0 interrupted iterations
sheet_get   [  81% ] 50 VUs  4m04.0s/5m0s

running (4m05.0s), 50/50 VUs, 220551 complete and 0 interrupted iterations
sheet_get   [  82% ] 50 VUs  4m05.0s/5m0s

running (4m06.0s), 50/50 VUs, 221482 complete and 0 interrupted iterations
sheet_get   [  82% ] 50 VUs  4m06.0s/5m0s

running (4m07.0s), 50/50 VUs, 222417 complete and 0 interrupted iterations
sheet_get   [  82% ] 50 VUs  4m07.0s/5m0s

running (4m08.0s), 50/50 VUs, 223354 complete and 0 interrupted iterations
sheet_get   [  83% ] 50 VUs  4m08.0s/5m0s

running (4m09.0s), 50/50 VUs, 224241 complete and 0 interrupted iterations
sheet_get   [  83% ] 50 VUs  4m09.0s/5m0s

running (4m10.0s), 50/50 VUs, 225086 complete and 0 interrupted iterations
sheet_get   [  83% ] 50 VUs  4m10.0s/5m0s

running (4m11.0s), 50/50 VUs, 226022 complete and 0 interrupted iterations
sheet_get   [  84% ] 50 VUs  4m11.0s/5m0s

running (4m12.0s), 50/50 VUs, 226947 complete and 0 interrupted iterations
sheet_get   [  84% ] 50 VUs  4m12.0s/5m0s

running (4m13.0s), 50/50 VUs, 227882 complete and 0 interrupted iterations
sheet_get   [  84% ] 50 VUs  4m13.0s/5m0s

running (4m14.0s), 50/50 VUs, 228673 complete and 0 interrupted iterations
sheet_get   [  85% ] 50 VUs  4m14.0s/5m0s

running (4m15.0s), 50/50 VUs, 229587 complete and 0 interrupted iterations
sheet_get   [  85% ] 50 VUs  4m15.0s/5m0s

running (4m16.0s), 50/50 VUs, 230404 complete and 0 interrupted iterations
sheet_get   [  85% ] 50 VUs  4m16.0s/5m0s

running (4m17.0s), 50/50 VUs, 231231 complete and 0 interrupted iterations
sheet_get   [  86% ] 50 VUs  4m17.0s/5m0s

running (4m18.0s), 50/50 VUs, 232153 complete and 0 interrupted iterations
sheet_get   [  86% ] 50 VUs  4m18.0s/5m0s

running (4m19.0s), 50/50 VUs, 233096 complete and 0 interrupted iterations
sheet_get   [  86% ] 50 VUs  4m19.0s/5m0s

running (4m20.0s), 50/50 VUs, 234041 complete and 0 interrupted iterations
sheet_get   [  87% ] 50 VUs  4m20.0s/5m0s

running (4m21.0s), 50/50 VUs, 234953 complete and 0 interrupted iterations
sheet_get   [  87% ] 50 VUs  4m21.0s/5m0s

running (4m22.0s), 50/50 VUs, 235828 complete and 0 interrupted iterations
sheet_get   [  87% ] 50 VUs  4m22.0s/5m0s

running (4m23.0s), 50/50 VUs, 236742 complete and 0 interrupted iterations
sheet_get   [  88% ] 50 VUs  4m23.0s/5m0s

running (4m24.0s), 50/50 VUs, 237673 complete and 0 interrupted iterations
sheet_get   [  88% ] 50 VUs  4m24.0s/5m0s

running (4m25.0s), 50/50 VUs, 238614 complete and 0 interrupted iterations
sheet_get   [  88% ] 50 VUs  4m25.0s/5m0s

running (4m26.0s), 50/50 VUs, 239569 complete and 0 interrupted iterations
sheet_get   [  89% ] 50 VUs  4m26.0s/5m0s

running (4m27.0s), 50/50 VUs, 240425 complete and 0 interrupted iterations
sheet_get   [  89% ] 50 VUs  4m27.0s/5m0s

running (4m28.0s), 50/50 VUs, 241287 complete and 0 interrupted iterations
sheet_get   [  89% ] 50 VUs  4m28.0s/5m0s

running (4m29.0s), 50/50 VUs, 242205 complete and 0 interrupted iterations
sheet_get   [  90% ] 50 VUs  4m29.0s/5m0s

running (4m30.0s), 50/50 VUs, 243168 complete and 0 interrupted iterations
sheet_get   [  90% ] 50 VUs  4m30.0s/5m0s

running (4m31.0s), 50/50 VUs, 244110 complete and 0 interrupted iterations
sheet_get   [  90% ] 50 VUs  4m31.0s/5m0s

running (4m32.0s), 50/50 VUs, 245022 complete and 0 interrupted iterations
sheet_get   [  91% ] 50 VUs  4m32.0s/5m0s

running (4m33.0s), 50/50 VUs, 245925 complete and 0 interrupted iterations
sheet_get   [  91% ] 50 VUs  4m33.0s/5m0s

running (4m34.0s), 50/50 VUs, 246830 complete and 0 interrupted iterations
sheet_get   [  91% ] 50 VUs  4m34.0s/5m0s

running (4m35.0s), 50/50 VUs, 247773 complete and 0 interrupted iterations
sheet_get   [  92% ] 50 VUs  4m35.0s/5m0s

running (4m36.0s), 50/50 VUs, 248716 complete and 0 interrupted iterations
sheet_get   [  92% ] 50 VUs  4m36.0s/5m0s

running (4m37.0s), 50/50 VUs, 249636 complete and 0 interrupted iterations
sheet_get   [  92% ] 50 VUs  4m37.0s/5m0s

running (4m38.0s), 50/50 VUs, 250555 complete and 0 interrupted iterations
sheet_get   [  93% ] 50 VUs  4m38.0s/5m0s

running (4m39.0s), 50/50 VUs, 251439 complete and 0 interrupted iterations
sheet_get   [  93% ] 50 VUs  4m39.0s/5m0s

running (4m40.0s), 50/50 VUs, 252341 complete and 0 interrupted iterations
sheet_get   [  93% ] 50 VUs  4m40.0s/5m0s

running (4m41.0s), 50/50 VUs, 253282 complete and 0 interrupted iterations
sheet_get   [  94% ] 50 VUs  4m41.0s/5m0s

running (4m42.0s), 50/50 VUs, 254223 complete and 0 interrupted iterations
sheet_get   [  94% ] 50 VUs  4m42.0s/5m0s

running (4m43.0s), 50/50 VUs, 255149 complete and 0 interrupted iterations
sheet_get   [  94% ] 50 VUs  4m43.0s/5m0s

running (4m44.0s), 50/50 VUs, 256077 complete and 0 interrupted iterations
sheet_get   [  95% ] 50 VUs  4m44.0s/5m0s

running (4m45.0s), 50/50 VUs, 256979 complete and 0 interrupted iterations
sheet_get   [  95% ] 50 VUs  4m45.0s/5m0s

running (4m46.0s), 50/50 VUs, 257807 complete and 0 interrupted iterations
sheet_get   [  95% ] 50 VUs  4m46.0s/5m0s

running (4m47.0s), 50/50 VUs, 258734 complete and 0 interrupted iterations
sheet_get   [  96% ] 50 VUs  4m47.0s/5m0s

running (4m48.0s), 50/50 VUs, 259637 complete and 0 interrupted iterations
sheet_get   [  96% ] 50 VUs  4m48.0s/5m0s

running (4m49.0s), 50/50 VUs, 260542 complete and 0 interrupted iterations
sheet_get   [  96% ] 50 VUs  4m49.0s/5m0s

running (4m50.0s), 50/50 VUs, 261460 complete and 0 interrupted iterations
sheet_get   [  97% ] 50 VUs  4m50.0s/5m0s

running (4m51.0s), 50/50 VUs, 262372 complete and 0 interrupted iterations
sheet_get   [  97% ] 50 VUs  4m51.0s/5m0s

running (4m52.0s), 50/50 VUs, 263243 complete and 0 interrupted iterations
sheet_get   [  97% ] 50 VUs  4m52.0s/5m0s

running (4m53.0s), 50/50 VUs, 264154 complete and 0 interrupted iterations
sheet_get   [  98% ] 50 VUs  4m53.0s/5m0s

running (4m54.0s), 50/50 VUs, 265106 complete and 0 interrupted iterations
sheet_get   [  98% ] 50 VUs  4m54.0s/5m0s

running (4m55.0s), 50/50 VUs, 266047 complete and 0 interrupted iterations
sheet_get   [  98% ] 50 VUs  4m55.0s/5m0s

running (4m56.0s), 50/50 VUs, 266941 complete and 0 interrupted iterations
sheet_get   [  99% ] 50 VUs  4m56.0s/5m0s

running (4m57.0s), 50/50 VUs, 267786 complete and 0 interrupted iterations
sheet_get   [  99% ] 50 VUs  4m57.0s/5m0s

running (4m58.0s), 50/50 VUs, 268666 complete and 0 interrupted iterations
sheet_get   [  99% ] 50 VUs  4m58.0s/5m0s

running (4m59.0s), 50/50 VUs, 269607 complete and 0 interrupted iterations
sheet_get   [ 100% ] 50 VUs  4m59.0s/5m0s

running (5m00.0s), 50/50 VUs, 270509 complete and 0 interrupted iterations
sheet_get   [ 100% ] 50 VUs  5m00.0s/5m0s
      ✓ status 200
      ✓ has body

      checks.........................: 100.00% ✓ 541162     ✗ 0     
      data_received..................: 651 MB  2.2 MB/s
      data_sent......................: 31 MB   102 kB/s
      http_req_blocked...............: min=1.88µs   avg=9.77µs  med=4.24µs  p(90)=5.68µs   p(95)=6.92µs   p(99)=60.63µs  max=41.77ms 
      http_req_connecting............: min=0s       avg=578ns   med=0s      p(90)=0s       p(95)=0s       p(99)=0s       max=12.8ms  
      http_req_duration..............: min=633.92µs avg=4.41ms  med=2.07ms  p(90)=10.6ms   p(95)=15.91ms  p(99)=30.14ms  max=383.52ms
        { expected_response:true }...: min=633.92µs avg=4.41ms  med=2.07ms  p(90)=10.6ms   p(95)=15.91ms  p(99)=30.14ms  max=383.52ms
      http_req_failed................: 0.00%   ✓ 0          ✗ 270581
      http_req_receiving.............: min=14.04µs  avg=91.08µs med=39.32µs p(90)=203.08µs p(95)=259.72µs p(99)=672.61µs max=76.1ms  
      http_req_sending...............: min=5µs      avg=46.86µs med=12.08µs p(90)=31.2µs   p(95)=143.48µs p(99)=561.17µs max=53.94ms 
      http_req_tls_handshaking.......: min=0s       avg=0s      med=0s      p(90)=0s       p(95)=0s       p(99)=0s       max=0s      
      http_req_waiting...............: min=583.64µs avg=4.27ms  med=1.95ms  p(90)=10.43ms  p(95)=15.71ms  p(99)=29.79ms  max=383.44ms
      http_reqs......................: 270581  901.776613/s
      iteration_duration.............: min=50.83ms  avg=55.41ms med=52.83ms p(90)=62.21ms  p(95)=67.93ms  p(99)=85ms     max=452.73ms
      iterations.....................: 270581  901.776613/s
    ✓ sheet_get_errors...............: 0.00%   ✓ 0          ✗ 270581
    ✓ sheet_get_latency_ms...........: min=0s       avg=4.5ms   med=2ms     p(90)=11ms     p(95)=16ms     p(99)=30ms     max=402ms   
      vus............................: 50      min=50       max=50  
      vus_max........................: 50      min=50       max=50  
running (5m00.1s), 00/50 VUs, 270581 complete and 0 interrupted iterations
sheet_get ✓ [ 100% ] 50 VUs  5m0s